{"config": [{"config": {"name": "dense_1", "trainable": true, "bias": true, "batch_input_shape": [null, 784], "init": "glorot_uniform", "b_constraint": null, "input_dim": 784, "output_dim": 500, "input_dtype": "float32", "W_regularizer": null, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "p": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "output_dim": 300, "W_regularizer": null, "W_constraint": null, "activation": "linear", "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "p": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "output_dim": 10, "W_regularizer": null, "W_constraint": null, "activation": "linear", "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_3", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}