{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "batch_input_shape": [null, 1, 28, 28], "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_filter": 32, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "name": "convolution2d_1", "nb_col": 3, "input_dtype": "float32", "activation": "relu", "dim_ordering": "th", "b_constraint": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 32, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "name": "convolution2d_2", "nb_col": 3, "activation": "relu", "dim_ordering": "th", "border_mode": "valid", "b_constraint": null, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "th", "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "name": "dense_5", "output_dim": 128, "activation": "relu", "bias": true, "b_constraint": null, "input_dim": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "name": "dense_6", "output_dim": 10, "activation": "softmax", "bias": true, "b_constraint": null, "input_dim": null}}]}